In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'Name':['Anna','Stuart','Alex','Nancy','Robert'],
                   'Subject1':['English','Maths','Geography','English','Maths']})

df2 = pd.DataFrame({'Name':['Alex','Robert','Anna','Stuart','nancy'],
                   'Subject2':['Electronics','Maths','Geography','English','Computer']})
df1

     Name   Subject1
0    Anna    English
1  Stuart      Maths
2    Alex  Geography
3   Nancy    English
4  Robert      Maths

In [3]:
df2

     Name     Subject2
0    Alex  Electronics
1  Robert        Maths
2    Anna    Geography
3  Stuart      English
4   nancy     Computer

In [5]:
df3 = pd.merge(df1,df2)
df3

     Name   Subject1     Subject2
0    Anna    English    Geography
1  Stuart      Maths      English
2    Alex  Geography  Electronics
3  Robert      Maths        Maths